[
  {
    "id": 1,
    "testimonial": "We had an outstanding purchase experience at Steven Kia for our new EV6 GT-line. Sai was the best.",
    "author": "~Paul Deeble"
  },
  {
    "id": 2,
    "testimonial": "Sai and Michael were very helpful in getting me in a new Kia Niro. I'm excited to start exploring and taking road trips!",
    "author": "~Joshua Brown"
  },
  {
    "id": 3,
    "testimonial": "Steven Kia is by far the best Kia dealership I have come across. I drove 120 miles to lease my car from them. My salesperson Sai Vang was awesome. Very pleasant to talk too and highly knowledgeable. Wish I could give 6 stars, too bad 5 out 5 is highest score Google allows.",
    "author": "~Rocco Constantino"
  },
  {
    "id": 4,
    "testimonial": "I have purchased over 15-20 new cars in my lifetime, and I have to say this was one of, if not the best, new car transaction I have ever dealt with. My salesperson was Sai Vang who was excellent!! No pressure found the car I wanted within a week and negotiated a more than fair price without the pressure tactics found in a lot of dealerships.",
    "author": "~Frank TechGuy"
  },
  {
    "id": 5,
    "testimonial": "Sai helped me purchase my first vehicle. He was very knowledgeable and all-around great guy. If you're looking to buy a vehicle, go to Sai highly recommend!",
    "author": "~islandwaves"
  },
  {
    "id": 6,
    "testimonial": "Sai Vang was an exceptional salesperson and went out of his way to help. The entire staff was pleasant during our purchase. I would totally recommend Sai as a salesperson for anyone needing a car.",
    "author": "~Amy Smith"
  },
  {
    "id": 7,
    "testimonial": "Sai will go above and beyond even years after sale to keep a positive customer experience. I’d recommend a Steven dealership before anywhere else! The Sodikoffs have a reputation for the extra mile!",
    "author": "~Celina Carpenter"
  },
  {
    "id": 8,
    "testimonial": "Fast service, made buying a used car easy . My salesman Sai was very helpful and knowledgeable great buying experience will for sure buy again from them.",
    "author": "~Robert Liptrap"
  },
  {
    "id": 9,
    "testimonial": "Anyone that plans on visiting Steven Kia in Harrisonburg if you ask for Sai, I am certain you will not be disappointed.",
    "author": "~Jeremy Breeden"
  },
  {
    "id": 10,
    "testimonial": "Was looking to trade my 2022 Kia Soul and wanted a truck went in and spoke with Sai vang. It was great from the start, shared conversation, listened to what I was looking for. It was one of the best experiences I have ever had at buying a car. He stayed informative about what was going on with approval and when all was said and done I drove off in a great truck and could not ask for a better salesman.",
    "author": "~Shannon Spitzer"
  },
  {
    "id": 11,
    "testimonial": "Salesman Sai did a wonderful job finding me the perfect vehicle to fit my needs. Matt the General Manager went great lengths to make sure I was pleased. The buying process was excellent. It was worth the drive from Northern VA to get great southern hospitality. 😁",
    "author": "~Matthew Davies"
  }
]
